<h1 align="center"> Introduction</h1>

<p> Use all the files to have a final datasets to have the following columns </p>
 <ul>
    <li>questid</li>
    <li>gender</li>
    <li>age (age of applicant)</li>
    <li>communeName (use data prep in commune file)</li>
    <li>application_date (created at in quest file)</li>
    <li>enroll_date (created_at in enroll file)</li>
    <li>is_enroll (Yes/No) (use data prep in enroll file)</li>
    <li>Education Level</li>
    <li>Communication channels(hear_AA1)</li>
    <li>Bootcamp Insterest (after_AA)</li>
    <li>Payement Date (use ord and transaction files)</li>
    <li>Payed (Yes/No)</li>
    <li>list Technologies as columns based (use get_dummies)</li>
    <li>list  Study domains (use get_dummies)</li>
    <li>Job is formal</li>
    <li>Have computer at home</li>
    <li>Have internet at home</li>
 </ul>
 
 <br>

<h1 align="center"> Project Setup </h1>

#### 1. Install all requirements for the project

In [127]:
# !pip install numpy
# !pip install pandas
# !pip install matplotlib
# !pip install seaborn
!pip install dateparser

Collecting dateparser
  Downloading dateparser-1.0.0-py2.py3-none-any.whl (279 kB)
     |████████████████████████████████| 279 kB 518 kB/s eta 0:00:01
Requirement already satisfied: python-dateutil in /Users/kesnel/opt/anaconda3/lib/python3.8/site-packages (from dateparser) (2.8.1)
Requirement already satisfied: regex!=2019.02.19 in /Users/kesnel/opt/anaconda3/lib/python3.8/site-packages (from dateparser) (2020.10.15)
Collecting tzlocal
  Downloading tzlocal-2.1-py2.py3-none-any.whl (16 kB)
Requirement already satisfied: pytz in /Users/kesnel/opt/anaconda3/lib/python3.8/site-packages (from dateparser) (2020.1)
Requirement already satisfied: six>=1.5 in /Users/kesnel/opt/anaconda3/lib/python3.8/site-packages (from python-dateutil->dateparser) (1.15.0)
Installing collected packages: tzlocal, dateparser
Successfully installed dateparser-1.0.0 tzlocal-2.1

#### 2. Importing Dependencies

In [171]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

import locale
import dateparser

from dateutil.parser import parse
locale.setlocale(locale.LC_TIME, 'fr_FR.UTF-8') 

import sys
from datetime import datetime as dt

#### 3. Define some usefull variables

In [140]:
DOCS_PATH = 'docs/'
DATA_PATH = 'data/'

#### 4. Importing Datasets

In [142]:
commune_df = pd.read_excel(DATA_PATH + "commune.xlsx")
enroll_df = pd.read_csv(DATA_PATH + "enroll.csv")
industry_df = pd.read_csv(DATA_PATH + "industry.csv")
ord_df = pd.read_csv(DATA_PATH + "ord.csv")
quest_df = pd.read_csv(DATA_PATH + "quest.csv")
studyd_df = pd.read_csv(DATA_PATH + "study_domain.csv")
tech_df = pd.read_csv(DATA_PATH + "technology.csv")
transaction_df = pd.read_csv(DATA_PATH + "transaction.csv")

<br><br>

<h1 align="center"> Data Processing </h1>

### 1. Transaction Dataset

>##### Data Overview

In [10]:
# Displaying first three entries
transaction_df.head(3)

,Unnamed: 0,created_at,modified_at,user_id,course_id,transaction_id
0,0,2021-03-08T05:08:50.832Z,2021-03-08T05:08:50.832Z,40976440,1047613,4641281952
1,1,2021-03-08T17:26:35.841Z,2021-03-08T17:26:35.841Z,41179271,1047613,4644270160
2,2,2021-03-08T18:52:09.147Z,2021-03-08T18:52:09.147Z,40973512,1047613,4645070622

In [11]:
# Check the shape of the DataFrame
row, col = transaction_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 60 rows and 6 columns

In [12]:
# Data info
transaction_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      60 non-null     int64
 1   created_at      60 non-null     object
 2   modified_at     60 non-null     object
 3   user_id         60 non-null     int64
 4   course_id       60 non-null     int64
 5   transaction_id  60 non-null     int64
dtypes: int64(4), object(2)
memory usage: 2.9+ KB

In [13]:
# Looking for duplicated values
print("This dataframe have", transaction_df.duplicated().sum(), "Duplicated value")

This dataframe have 0 Duplicated value

In [14]:
# Check if we have missing values in our columns
print("This dataframe have", transaction_df.isna().sum().sum(), "missing values")

This dataframe have 0 missing values

>##### Data Overview

In [15]:
# Make a new dataframe
transaction_df.columns

Index(['Unnamed: 0', 'created_at', 'modified_at', 'user_id', 'course_id',
       'transaction_id'],
      dtype='object')

In [16]:
# Create a new Dataframe 
new_transaction_df = transaction_df[['created_at','user_id']]

In [17]:
# Rename 'Created' to 'Payment Date'
final_transaction_df = new_transaction_df.rename(columns={'created_at':'Payment_Date'})

In [18]:
# Display our new dataframe
final_transaction_df.head(2)

               Payment_Date   user_id
0  2021-03-08T05:08:50.832Z  40976440
1  2021-03-08T17:26:35.841Z  41179271

<hr>

### 2. Ord Dataset

>##### Data Overview

In [19]:
# Displaying first entry
ord_df.head(1)

,Unnamed: 0,created_at,user_id,product_name,product_id,amount_dollars,amount_cents,subscription,coupon_code,coupon_id,affiliate_referral_code,status,quest_id
0,0,2021-03-14T15:34:35.014Z,41587952,Entwodiksyon Nan Syans Done,1100636,20,2000,False,NaN,NaN,NaN,Complete,906b3c86-ce95-11eb-b6a7-7c67a234f601

In [20]:
# Shape of the DataFrame
row, col = ord_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 18 rows and 13 columns

In [21]:
# Data info
ord_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Unnamed: 0               18 non-null     int64
 1   created_at               18 non-null     object
 2   user_id                  18 non-null     int64
 3   product_name             18 non-null     object
 4   product_id               18 non-null     int64
 5   amount_dollars           18 non-null     int64
 6   amount_cents             18 non-null     int64
 7   subscription             18 non-null     bool
 8   coupon_code              4 non-null      object
 9   coupon_id                4 non-null      float64
 10  affiliate_referral_code  0 non-null      float64
 11  status                   18 non-null     object
 12  quest_id                 14 non-null     object
dtypes: bool(1), float64(2), int64(5), object(5)
memory usage: 1.8+ KB

In [22]:
# Describe the dataset
ord_df.describe()

,Unnamed: 0,user_id,product_id,amount_dollars,amount_cents,coupon_id,affiliate_referral_code
count,18.000000,1.800000e+01,18.0,18.000000,18.000000,4.000000e+00,0.0
mean,8.500000,3.978105e+07,1100636.0,15.555556,1555.555556,6.535246e+06,NaN
std,5.338539,1.879479e+06,0.0,8.555853,855.585264,8.718553e+04,NaN
min,0.000000,3.485615e+07,1100636.0,0.000000,0.000000,6.452874e+06,NaN
25%,4.250000,3.989797e+07,1100636.0,20.000000,2000.000000,6.498275e+06,NaN
50%,8.500000,4.020500e+07,1100636.0,20.000000,2000.000000,6.514828e+06,NaN
75%,12.750000,4.038378e+07,1100636.0,20.000000,2000.000000,6.551799e+06,NaN
max,17.000000,4.158795e+07,1100636.0,20.000000,2000.000000,6.658457e+06,NaN

In [23]:
# Make sure our columns don't have duplicate values
print("This dataframe have", ord_df.duplicated().sum(), "Duplicated value")

This dataframe have 0 Duplicated value

>##### Data preparation

In [24]:
# See how many columns we are going to use.
ord_df.columns

Index(['Unnamed: 0', 'created_at', 'user_id', 'product_name', 'product_id',
       'amount_dollars', 'amount_cents', 'subscription', 'coupon_code',
       'coupon_id', 'affiliate_referral_code', 'status', 'quest_id'],
      dtype='object')

In [25]:
# Create a new order dataframe
new_ord_df = ord_df[['created_at','user_id']]

In [26]:
# Rename Created at to Payment date
final_ord_df = new_ord_df.rename(columns={'created_at':'Payment_Date'})

In [27]:
# Concat both of the Payment DataFrame
payment_df = pd.concat([final_ord_df,final_transaction_df],ignore_index=True, axis=0)

In [28]:
# Preview our new dataframe
payment_df.head(3)

               Payment_Date   user_id
0  2021-03-14T15:34:35.014Z  41587952
1  2021-03-14T04:20:23.483Z  41564742
2  2021-03-12T19:29:22.832Z  41501853

In [29]:
payment_df.shape

(78, 2)

<hr>

### 3. Enroll Dataset

>##### Data Overview

In [30]:
# Displaying first entry of Enroll dataset
enroll_df.head(1)

,Unnamed: 0,created_at,expiry_date,user_id,course_name,course_id,percentage_completed,completed_at,expired,is_free_trial,completed,started_at,activated_at,updated_at,quest_id
0,0,2020-12-12T06:41:29.844Z,NaN,29816173,Entwodiksyon Nan Syans Done,1047613,0.0,NaN,False,True,False,NaN,NaN,2020-12-12T06:41:29.844Z,NaN

In [31]:
# Check the observations and variables of the DataFrame
row, col = enroll_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 148 rows and 15 columns

In [32]:
# Data info
enroll_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 15 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            148 non-null    int64
 1   created_at            148 non-null    object
 2   expiry_date           60 non-null     object
 3   user_id               148 non-null    int64
 4   course_name           148 non-null    object
 5   course_id             148 non-null    int64
 6   percentage_completed  148 non-null    float64
 7   completed_at          0 non-null      float64
 8   expired               148 non-null    bool
 9   is_free_trial         148 non-null    bool
 10  completed             148 non-null    bool
 11  started_at            135 non-null    object
 12  activated_at          77 non-null     object
 13  updated_at            148 non-null    object
 14  quest_id              102 non-null    object
dtypes: bool(3), float64(2), int64(3), object(7)
memory usage: 14.4+ KB

In [33]:
# Describe the dataset
enroll_df.describe()

       Unnamed: 0       user_id  course_id  percentage_completed  completed_at
count  148.000000  1.480000e+02      148.0            148.000000           0.0
mean    73.500000  3.982423e+07  1047613.0              0.249925           NaN
std     42.868014  1.782956e+06        0.0              0.313651           NaN
min      0.000000  2.981617e+07  1047613.0              0.000000           NaN
25%     36.750000  3.989802e+07  1047613.0              0.000000           NaN
50%     73.500000  4.009749e+07  1047613.0              0.023810           NaN
75%    110.250000  4.062487e+07  1047613.0              0.418605           NaN
max    147.000000  4.159270e+07  1047613.0              0.953488           NaN

In [34]:
# Make sure our columns don't have duplicate values
print("This dataframe have", enroll_df.duplicated().sum(), "Duplicated value")

This dataframe have 0 Duplicated value

In [35]:
# Check if we have missing values in our columns
print("This dataframe have", enroll_df.isna().sum(), "missing values")

This dataframe have Unnamed: 0                0
created_at                0
expiry_date              88
user_id                   0
course_name               0
course_id                 0
percentage_completed      0
completed_at            148
expired                   0
is_free_trial             0
completed                 0
started_at               13
activated_at             71
updated_at                0
quest_id                 46
dtype: int64 missing values

In [36]:
# How many missing values we have
print("This dataframe have", enroll_df.isna().sum().sum(), "missing values")

This dataframe have 366 missing values

>##### Data Preparation

In [37]:
# Create a new dataframe
new_enroll = enroll_df[['created_at','user_id','quest_id']]

In [38]:
# Rename 'created_at' to 'Enroll_Date'
new_enroll_df = new_enroll.rename(columns={'created_at':'Enroll_Date'})
new_enroll_df.head(3)

                Enroll_Date   user_id quest_id
0  2020-12-12T06:41:29.844Z  29816173      NaN
1  2020-12-13T14:41:17.720Z  35229766      NaN
2  2020-12-15T00:53:06.499Z  31987560      NaN

In [39]:
final_enroll = pd.merge(new_enroll_df,payment_df, on="user_id", how="outer")
final_enroll.head(2)

                Enroll_Date   user_id quest_id Payment_Date
0  2020-12-12T06:41:29.844Z  29816173      NaN          NaN
1  2020-12-13T14:41:17.720Z  35229766      NaN          NaN

In [40]:
final_enroll.columns

Index(['Enroll_Date', 'user_id', 'quest_id', 'Payment_Date'], dtype='object')

In [41]:
# now let's delete all useless columns to have a clean dataframe with all Payment info
drop_fenroll = ['user_id']
final_enroll_df = final_enroll.drop(drop_fenroll, axis=1)

In [42]:
# Display our Final Enroll dataset
final_enroll_df.head(5)

                Enroll_Date quest_id Payment_Date
0  2020-12-12T06:41:29.844Z      NaN          NaN
1  2020-12-13T14:41:17.720Z      NaN          NaN
2  2020-12-15T00:53:06.499Z      NaN          NaN
3  2020-12-18T18:38:55.683Z      NaN          NaN
4  2020-12-21T14:45:06.528Z      NaN          NaN

In [43]:
final_enroll_df.shape

(149, 3)

<hr>

### 4. Study Domain Dataset

>##### Data Overview

In [44]:
# Displaying latest entries of the dataset
studyd_df.tail()

     Unnamed: 0    key            values                              quest_id
282         282  other             other  906b3c84-ce95-11eb-8c2a-7c67a234f601
283         283  item8          Medicine  906b3c85-ce95-11eb-9b87-7c67a234f601
284         284  item2        Statistics  906b3c86-ce95-11eb-b6a7-7c67a234f601
285         285  item1  Computer Science  906b65e2-ce95-11eb-8b5c-7c67a234f601
286         286  other             other  906b65e3-ce95-11eb-a294-7c67a234f601

In [45]:
# Check the shape of the DataFrame
row, col = studyd_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 287 rows and 4 columns

In [46]:
# Data info
studyd_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 287 entries, 0 to 286
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  287 non-null    int64
 1   key         287 non-null    object
 2   values      287 non-null    object
 3   quest_id    287 non-null    object
dtypes: int64(1), object(3)
memory usage: 9.1+ KB

In [47]:
# Make sure our columns don't have duplicate values
print("This dataframe have", studyd_df.duplicated().sum(), "Duplicated value")

This dataframe have 0 Duplicated value

In [48]:
# Check if we have missing values in our columns
print("This dataframe have", studyd_df.isna().sum(), "missing values")

This dataframe have Unnamed: 0    0
key           0
values        0
quest_id      0
dtype: int64 missing values

**Conclusion:** just checking that there are no missing and duplicated values in the study domain dataset...

>##### Data Preparation

In [49]:
studyd_drop = ['Unnamed: 0']
dropped_studyd_df = studyd_df.drop(studyd_drop, axis=1)

In [50]:
# Find all duplicated values in the
dropped_studyd_df.head(2)

     key            values                              quest_id
0  other             other  905ddcf2-ce95-11eb-9a92-7c67a234f601
1  item1  Computer Science  905e4cf5-ce95-11eb-96a9-7c67a234f601

In [51]:
# Grouped all our study domain
dropped_studyd_df['Study_Domains'] = dropped_studyd_df.groupby('quest_id')['values'].transform(lambda x: ', '.join(x))

In [52]:
# Display the dataframe
dropped_studyd_df.head(4)

,key,values,quest_id,Study_Domains
0,other,other,905ddcf2-ce95-11eb-9a92-7c67a234f601,other
1,item1,Computer Science,905e4cf5-ce95-11eb-96a9-7c67a234f601,"Computer Science, Management"
2,item6,Management,905e4cf5-ce95-11eb-96a9-7c67a234f601,"Computer Science, Management"
3,other,other,905e73fd-ce95-11eb-a7b0-7c67a234f601,other

In [53]:
dropped_studyd_df.shape

(287, 4)

In [54]:
# Drop all useless columns
study_domain_df = dropped_studyd_df.drop(columns=['key','values'])

In [55]:
# Let's check for some duplicated values
study_domain_df.duplicated().sum()

43

In [56]:
# Now let's drop all duplicate values in the dataset
final_studyd_df = study_domain_df.drop_duplicates()

In [57]:
# Display our fresh datadrame
final_studyd_df.head(5)

                               quest_id                 Study_Domains
0  905ddcf2-ce95-11eb-9a92-7c67a234f601                         other
1  905e4cf5-ce95-11eb-96a9-7c67a234f601  Computer Science, Management
3  905e73fd-ce95-11eb-a7b0-7c67a234f601                         other
4  905e9b27-ce95-11eb-9c37-7c67a234f601                         other
5  905ec1ec-ce95-11eb-8136-7c67a234f601              Computer Science

In [58]:
final_studyd_df.shape

(244, 2)

<hr>

### 5. Tech Dataset

>##### Data Overview

In [59]:
# Displaying first entries
tech_df.head()

   Unnamed: 0     key      values                              quest_id
0           0   item1           R  905ddcf2-ce95-11eb-9a92-7c67a234f601
1           1  item11       Excel  905ddcf2-ce95-11eb-9a92-7c67a234f601
2           2   item2      Python  905e2608-ce95-11eb-809f-7c67a234f601
3           3   item3        Java  905e2608-ce95-11eb-809f-7c67a234f601
4           4   item4  JavaScript  905e2608-ce95-11eb-809f-7c67a234f601

In [60]:
# Check the dimensions of the DataFrame
row, col = tech_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 678 rows and 4 columns

In [61]:
# Data info
tech_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 678 entries, 0 to 677
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  678 non-null    int64
 1   key         678 non-null    object
 2   values      678 non-null    object
 3   quest_id    678 non-null    object
dtypes: int64(1), object(3)
memory usage: 21.3+ KB

In [62]:
# Looking for duplicated values
print("This dataframe have", tech_df.duplicated().sum(), "Duplicated value")

This dataframe have 0 Duplicated value

In [63]:
# Check if we have missing values in our columns
print("This dataframe have", tech_df.isna().sum(), "missing values")

This dataframe have Unnamed: 0    0
key           0
values        0
quest_id      0
dtype: int64 missing values

>##### Data Preparation

In [64]:
tech_df.columns

Index(['Unnamed: 0', 'key', 'values', 'quest_id'], dtype='object')

In [65]:
# Drop column we will no longer use
tech_df_drop = ['Unnamed: 0']
dropped_tech_df = tech_df.drop(tech_df_drop, axis=1)

In [66]:
# Grouped all our study domain
dropped_tech_df['List_Technologies'] = dropped_tech_df.groupby('quest_id')['values'].transform(lambda x: ', '.join(x))

In [67]:
# Display our grouped dataframe
dropped_tech_df.head(5)

,key,values,quest_id,List_Technologies
0,item1,R,905ddcf2-ce95-11eb-9a92-7c67a234f601,"R, Excel"
1,item11,Excel,905ddcf2-ce95-11eb-9a92-7c67a234f601,"R, Excel"
2,item2,Python,905e2608-ce95-11eb-809f-7c67a234f601,"Python, Java, JavaScript, SQL, Excel, Bash, Git"
3,item3,Java,905e2608-ce95-11eb-809f-7c67a234f601,"Python, Java, JavaScript, SQL, Excel, Bash, Git"
4,item4,JavaScript,905e2608-ce95-11eb-809f-7c67a234f601,"Python, Java, JavaScript, SQL, Excel, Bash, Git"

In [68]:
# Drop all useless columns now
final_tech = dropped_tech_df.drop(columns=['key','values'])

In [69]:
# Display dataframe
final_tech.head(5)

,quest_id,List_Technologies
0,905ddcf2-ce95-11eb-9a92-7c67a234f601,"R, Excel"
1,905ddcf2-ce95-11eb-9a92-7c67a234f601,"R, Excel"
2,905e2608-ce95-11eb-809f-7c67a234f601,"Python, Java, JavaScript, SQL, Excel, Bash, Git"
3,905e2608-ce95-11eb-809f-7c67a234f601,"Python, Java, JavaScript, SQL, Excel, Bash, Git"
4,905e2608-ce95-11eb-809f-7c67a234f601,"Python, Java, JavaScript, SQL, Excel, Bash, Git"

In [70]:
final_tech.shape

(678, 2)

In [71]:
# Let's check for some duplicated values
final_tech.duplicated().sum()

434

In [72]:
# Remove all duplicates dummies values
final_tech_df = final_tech.drop_duplicates()

In [73]:
# Final Tech dataset
final_tech_df.head(5)

,quest_id,List_Technologies
0,905ddcf2-ce95-11eb-9a92-7c67a234f601,"R, Excel"
2,905e2608-ce95-11eb-809f-7c67a234f601,"Python, Java, JavaScript, SQL, Excel, Bash, Git"
9,905e4cf5-ce95-11eb-96a9-7c67a234f601,"Excel, Java, JavaScript, PHP, Python"
14,905e73fd-ce95-11eb-a7b0-7c67a234f601,"PHP, Bash"
16,905e9b27-ce95-11eb-9c37-7c67a234f601,"Python, Excel, JavaScript, Java, SQL"

In [74]:
final_tech_df.shape

(244, 2)

In [75]:
# Let's merge 'Technologies' with 'Study Domain'
studyd_tech = pd.merge(final_tech_df,final_studyd_df,on="quest_id",how="outer")
studyd_tech.head(3)

,quest_id,List_Technologies,Study_Domains
0,905ddcf2-ce95-11eb-9a92-7c67a234f601,"R, Excel",other
1,905e2608-ce95-11eb-809f-7c67a234f601,"Python, Java, JavaScript, SQL, Excel, Bash, Git",NaN
2,905e4cf5-ce95-11eb-96a9-7c67a234f601,"Excel, Java, JavaScript, PHP, Python","Computer Science, Management"

<hr>

### 6. Commune Dataset

>##### Data Overview

In [76]:
# Displaying first two entries of the Commune dataset using DataFrame.head()
commune_df.head(2)

     Commune_en    Commune_FR Commune_Id  Departement ADM1_PCODE
0      Abricots      Abricots     HT0812  Grande'Anse       HT08
1  Acul du Nord  Acul du Nord     HT0321        North       HT03

In [77]:
# Check the shape of the DataFrame
row, col = commune_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 140 rows and 5 columns

In [78]:
# Data info
commune_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 140 entries, 0 to 139
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Commune_en   140 non-null    object
 1   Commune_FR   140 non-null    object
 2   Commune_Id   140 non-null    object
 3   Departement  140 non-null    object
 4   ADM1_PCODE   140 non-null    object
dtypes: object(5)
memory usage: 5.6+ KB

In [79]:
# Describe the dataset
commune_df.describe()

        Commune_en  Commune_FR Commune_Id Departement ADM1_PCODE
count          140         140        140         140        140
unique         140         140        140          10         10
top     Saut d'Eau  Saut d'Eau     HT0733        West       HT01
freq             1           1          1          20         20

In [80]:
# Make sure our columns don't have duplicate values.
commune_df.duplicated().sum()

0

In [81]:
# Make sure our columns don't have missing values.
commune_df.isna().sum()

Commune_en     0
Commune_FR     0
Commune_Id     0
Departement    0
ADM1_PCODE     0
dtype: int64

>##### Data Preparation

In [82]:
# Drop all columns we will not use in this dataset
commune_to_drop = ['Commune_FR','Departement','ADM1_PCODE']
new_commune_df = commune_df.drop(commune_to_drop, axis = 1)

In [83]:
# Displaying our clean dataset
new_commune_df.head(3)

      Commune_en Commune_Id
0       Abricots     HT0812
1   Acul du Nord     HT0321
2  Anse-a-Foleur     HT0922

<hr>

### 7. Questions Dataset

>##### Data Overview

In [84]:
# Displaying first entries
quest_df.head(2)

,Unnamed: 0,gender,dob,commune,created_at,modified_at,department,education_level,university,study_domain,current_employed,formal_sector_job,have_computer_home,internet_at_home,hear_AA_1,after_AA,quest_id
0,0,male,25/08/1998,ht0111,2021-02-14T23:03:52.768400Z,2021-02-14T23:03:52.768462Z,NaN,unknown,unknown,[],unknown,unknown,unknown,unknown,unknown,unknown,905dc006-ce95-11eb-b2f9-7c67a234f601
1,1,female,29/09/1996,ht0111,2021-02-16T16:01:10.861844Z,2021-02-16T16:01:10.861899Z,ht01,Bachelors (bacc +4),other,['other'],No,unknown,Yes,Yes,Friend,Finding a job/internship,905ddcf2-ce95-11eb-9a92-7c67a234f601

In [85]:
# Check the dimensions of the DataFrame
row, col = quest_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 250 rows and 17 columns

In [86]:
# Data info
quest_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 17 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          250 non-null    int64
 1   gender              250 non-null    object
 2   dob                 244 non-null    object
 3   commune             250 non-null    object
 4   created_at          250 non-null    object
 5   modified_at         250 non-null    object
 6   department          249 non-null    object
 7   education_level     250 non-null    object
 8   university          250 non-null    object
 9   study_domain        250 non-null    object
 10  current_employed    250 non-null    object
 11  formal_sector_job   250 non-null    object
 12  have_computer_home  250 non-null    object
 13  internet_at_home    250 non-null    object
 14  hear_AA_1           250 non-null    object
 15  after_AA            250 non-null    object
 16  quest_id            250 non-null    object
dtypes: int64(1), object(16)
memory usage: 33.3+ KB

In [87]:
# Finding duplicated rows
print(quest_df.duplicated().sum(),"duplicated rows")

0 duplicated rows

In [88]:
# Check if we have missing values in our columns
print("This dataframe have", quest_df.isna().sum(), "missing values")

This dataframe have Unnamed: 0            0
gender                0
dob                   6
commune               0
created_at            0
modified_at           0
department            1
education_level       0
university            0
study_domain          0
current_employed      0
formal_sector_job     0
have_computer_home    0
internet_at_home      0
hear_AA_1             0
after_AA              0
quest_id              0
dtype: int64 missing values

In [89]:
# How many missing values we have
print("This dataframe have", quest_df.isna().sum().sum(), "missing values")

This dataframe have 7 missing values

>##### Data Preparation

In [90]:
quest_df.columns

Index(['Unnamed: 0', 'gender', 'dob', 'commune', 'created_at', 'modified_at',
       'department', 'education_level', 'university', 'study_domain',
       'current_employed', 'formal_sector_job', 'have_computer_home',
       'internet_at_home', 'hear_AA_1', 'after_AA', 'quest_id'],
      dtype='object')

In [91]:
# Create a new dataframe with selected columns
quest_to_drop = ['Unnamed: 0','modified_at','department','university','current_employed']
dropped_quest_df = quest_df.drop(quest_to_drop, axis=1)

In [92]:
# Display our new columns
dropped_quest_df.columns

Index(['gender', 'dob', 'commune', 'created_at', 'education_level',
       'study_domain', 'formal_sector_job', 'have_computer_home',
       'internet_at_home', 'hear_AA_1', 'after_AA', 'quest_id'],
      dtype='object')

In [93]:
# Change all commune ID to uppercase before merging
dropped_quest_df.commune = dropped_quest_df['commune'].str.upper()

In [94]:
# Change the commune to Commune_ID to merge it with the commune dataset
rename_quest = dropped_quest_df.rename(columns={'commune':'Commune_Id'})

In [95]:
# Now let's merge our commune dataset with the Question's dataset
merged_quest_commune = pd.merge(new_commune_df,rename_quest, on="Commune_Id", how="inner")

In [96]:
# Drop the Commune ID, we will no longer use it in the project
quest_to_drop = ['Commune_Id']
final_quest = merged_quest_commune.drop(quest_to_drop, axis=1)

In [97]:
# Change also some columns name...
final_quest_df = final_quest.rename(columns={'Commune_en':'Commune_Name',
                                             'hear_AA_1':'Communication_Channels',
                                             'after_AA':'Bootcamp_Interest',
                                          'created_at':'Application_Date'})

In [98]:
# Display the dataset
final_quest_df.head(2)

,Commune_Name,gender,dob,Application_Date,education_level,study_domain,formal_sector_job,have_computer_home,internet_at_home,Communication_Channels,Bootcamp_Interest,quest_id
0,Aquin,male,12/05/1995,2021-02-16T18:14:20.488505Z,Bachelors (bacc +4),"['item6', 'item1']",unknown,Yes,Yes,Friend,Training to start my own company,9069789e-ce95-11eb-883e-7c67a234f601
1,Cap-Haitien,male,16/09/1995,2021-02-21T12:38:57.408531Z,Bachelors (bacc +4),['other'],No,Yes,Yes,Facebook,Finding a job/internship,906a79ae-ce95-11eb-98c3-7c67a234f601

In [99]:
final_quest_df.shape

(250, 12)

##### Combine our Enroll dataset with the question dataset

In [100]:
# Let's merge our Enroll dataset with the question dataset
quest_enroll = pd.merge(final_quest_df,final_enroll_df,on="quest_id",how="outer")

In [101]:
# Display our new 'Enroll' and 'Quest' dataframe
quest_enroll.head(2)

,Commune_Name,gender,dob,Application_Date,education_level,study_domain,formal_sector_job,have_computer_home,internet_at_home,Communication_Channels,Bootcamp_Interest,quest_id,Enroll_Date,Payment_Date
0,Aquin,male,12/05/1995,2021-02-16T18:14:20.488505Z,Bachelors (bacc +4),"['item6', 'item1']",unknown,Yes,Yes,Friend,Training to start my own company,9069789e-ce95-11eb-883e-7c67a234f601,NaN,NaN
1,Cap-Haitien,male,16/09/1995,2021-02-21T12:38:57.408531Z,Bachelors (bacc +4),['other'],No,Yes,Yes,Facebook,Finding a job/internship,906a79ae-ce95-11eb-98c3-7c67a234f601,2021-02-21T12:41:32.008Z,NaN

In [102]:
quest_enroll.shape

(297, 14)

### Create our final dataset

In [103]:
# Reviewing our merged Quest and Enroll columns before merging it with the StudyDomain_Technlogy column, to have the final dataframe
quest_enroll.columns

Index(['Commune_Name', 'gender', 'dob', 'Application_Date', 'education_level',
       'study_domain', 'formal_sector_job', 'have_computer_home',
       'internet_at_home', 'Communication_Channels', 'Bootcamp_Interest',
       'quest_id', 'Enroll_Date', 'Payment_Date'],
      dtype='object')

In [104]:
# merged 'Study Domain' and 'Technologies' columns
studyd_tech.columns

Index(['quest_id', 'List_Technologies', 'Study_Domains'], dtype='object')

In [143]:
# Merge all our dataframe to have a final dataset
final = pd.merge(quest_enroll,studyd_tech,on="quest_id",how="outer")

In [144]:
# Display our final Dataframe
final.head(1)

,Commune_Name,gender,dob,Application_Date,education_level,study_domain,formal_sector_job,have_computer_home,internet_at_home,Communication_Channels,Bootcamp_Interest,quest_id,Enroll_Date,Payment_Date,List_Technologies,Study_Domains
0,Aquin,male,12/05/1995,2021-02-16T18:14:20.488505Z,Bachelors (bacc +4),"['item6', 'item1']",unknown,Yes,Yes,Friend,Training to start my own company,9069789e-ce95-11eb-883e-7c67a234f601,NaN,NaN,"Java, PHP","Management, Computer Science"

<h4> A - Now we are going to make our new column ['Age'] </h4> 
<p> but, before doing this we are going to: </p>
<ol>
    <li> Convert our application_date column to the same format (DD/MM/YYYY) as the dob column </li>
    <li> Convert our dob column to datetime. </li> 
</ol>

In [145]:
# 1. Convert the final['Application_Date'] to Datetime Type
final.Application_Date = pd.to_datetime(final.Application_Date)
final[['Application_Date']].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 297 entries, 0 to 296
Data columns (total 1 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Application_Date  250 non-null    datetime64[ns, UTC]
dtypes: datetime64[ns, UTC](1)
memory usage: 4.6 KB

In [151]:
# 2.1 Convert the final['dob'] to Datetime Type
final.dob = final.dob.apply(lambda x: dateparser.parse(str(x)))
final[['dob']].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 297 entries, 0 to 296
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dob     297 non-null    datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 4.6 KB

In [152]:
# Remove the timezone before the operation
app_date = final.Application_Date.dt.date
dob_date = final.dob.dt.date

# create a new Age dataframe ~ Calculate the age
final["Age"] = (app_date - dob_date)

In [153]:
final["Age"] = final.Age // np.timedelta64(1,"Y")

In [154]:
# Remove the age as float to int
final.Age = final["Age"].astype('Int64')

In [155]:
# Display the Age columns
final[['Age']].head(3)

   Age
0   25
1   25
2   33

<h4> B - Now we are going to create our new column ['is_enrolled'] and ['Payed'] </h4>

In [156]:
'''
1. Specify if the student enrolled to the Bootcamp or not. 

How we are going to do this:
- Based on the final dataframe, if the 'Enrolled_date' have NaN values, 
  our new 'Is_Enrolled' column will automatically display NO as value; and YES if the 'Enrolled_date' is not NaN
'''

final['is_enrolled'] = 'No'
final.loc[~final.Enroll_Date.isna(),["is_enrolled"]] = "Yes"

In [157]:
'''
2. Specify if the student paid the Bootcamp or not. 

How we are going to do this:
- Based on the final dataframe, if the 'Payment_Date' have NaN values, 
  our new 'Paid' column will automatically display NO as value; and YES if the 'Payment_Date' is not NaN
'''

final['Paid'] = 'No'
final.loc[~final.Payment_Date.isna(),["Paid"]] = "Yes"

In [174]:
# Display the dataset to see if it's working
final

,Commune_Name,gender,dob,Application_Date,education_level,study_domain,formal_sector_job,have_computer_home,internet_at_home,Communication_Channels,Bootcamp_Interest,quest_id,Enroll_Date,Payment_Date,List_Technologies,Study_Domains,Age,is_enrolled,Paid
0,Aquin,male,1995-12-05,2021-02-16 18:14:20.488505+00:00,Bachelors (bacc +4),"['item6', 'item1']",unknown,Yes,Yes,Friend,Training to start my own company,9069789e-ce95-11eb-883e-7c67a234f601,NaN,NaN,"Java, PHP","Management, Computer Science",25,No,No
1,Cap-Haitien,male,1995-09-16,2021-02-21 12:38:57.408531+00:00,Bachelors (bacc +4),['other'],No,Yes,Yes,Facebook,Finding a job/internship,906a79ae-ce95-11eb-98c3-7c67a234f601,2021-02-21T12:41:32.008Z,NaN,"Excel, other",other,25,Yes,No
2,Cap-Haitien,male,1987-04-19,2021-02-21 16:06:15.024499+00:00,Bachelors (bacc +4),['item1'],unknown,Yes,No,Friend,Improving my data analysis skills,906a79af-ce95-11eb-bd36-7c67a234f601,2021-02-23T12:21:53.058Z,NaN,"Java, PHP, Excel, SQL",Computer Science,33,Yes,No
3,Cap-Haitien,male,1991-09-08,2021-03-03 00:04:49.909094+00:00,Other,['item7'],unknown,Yes,No,Facebook,Mentorship,906aa0a0-ce95-11eb-8355-7c67a234f601,2021-03-03T00:12:31.944Z,NaN,NaN,Law,29,Yes,No
4,Cap-Haitien,male,1987-02-22,2021-03-05 10:29:32.308601+00:00,Bachelors (bacc +4),"['item7', 'other']",unknown,Yes,Yes,Facebook,Improving my data analysis skills,906aa0a1-ce95-11eb-899e-7c67a234f601,NaN,NaN,Excel,"Law, other",34,No,No
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
292,NaN,NaN,2021-08-25,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2021-03-11T18:17:55.814Z,2021-03-11T18:17:56.004Z,NaN,NaN,<NA>,Yes,Yes
293,NaN,NaN,2021-08-25,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2021-03-12T20:25:22.271Z,2021-03-12T20:25:22.517Z,NaN,NaN,<NA>,Yes,Yes
294,NaN,NaN,2021-08-25,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2021-03-13T00:48:13.622Z,2021-03-13T00:48:13.726Z,NaN,NaN,<NA>,Yes,Yes
295,NaN,NaN,2021-08-25,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2021-03-14T17:34:44.861Z,2021-03-14T17:34:45.179Z,NaN,NaN,<NA>,Yes,Yes
296,NaN,NaN,2021-08-25,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2021-02-25T04:45:53.407Z,NaN,NaN,<NA>,No,Yes

#### Final Dataframe

In [159]:
# Reviewing our final dataset columns
final.columns

Index(['Commune_Name', 'gender', 'dob', 'Application_Date', 'education_level',
       'study_domain', 'formal_sector_job', 'have_computer_home',
       'internet_at_home', 'Communication_Channels', 'Bootcamp_Interest',
       'quest_id', 'Enroll_Date', 'Payment_Date', 'List_Technologies',
       'Study_Domains', 'Age', 'is_enrolled', 'Paid'],
      dtype='object')

In [160]:
# Reordering our columns to have a new dataframe
final_df = final[['quest_id',
                  'gender',
                  'Age',
                  'Commune_Name',
                  'Application_Date',
                  'Enroll_Date',
                  'is_enrolled',
                  'education_level',
                  'Communication_Channels',
                  'Bootcamp_Interest',
                  'Payment_Date',
                  'Paid',
                  'List_Technologies',
                  'Study_Domains',
                  'formal_sector_job',
                  'have_computer_home',
                  'internet_at_home']]

<br>
<h2 align=center> Final Dataset </h2>

In [161]:
# Displaying first entry of Enroll dataset
final_df.head(1)

,quest_id,gender,Age,Commune_Name,Application_Date,Enroll_Date,is_enrolled,education_level,Communication_Channels,Bootcamp_Interest,Payment_Date,Paid,List_Technologies,Study_Domains,formal_sector_job,have_computer_home,internet_at_home
0,9069789e-ce95-11eb-883e-7c67a234f601,male,25,Aquin,2021-02-16 18:14:20.488505+00:00,NaN,No,Bachelors (bacc +4),Friend,Training to start my own company,NaN,No,"Java, PHP","Management, Computer Science",unknown,Yes,Yes

In [162]:
# Check the shape of the DataFrame
row, col = final_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 297 rows and 17 columns

In [163]:
# Data info
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 297 entries, 0 to 296
Data columns (total 17 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   quest_id                250 non-null    object
 1   gender                  250 non-null    object
 2   Age                     250 non-null    Int64
 3   Commune_Name            250 non-null    object
 4   Application_Date        250 non-null    datetime64[ns, UTC]
 5   Enroll_Date             148 non-null    object
 6   is_enrolled             297 non-null    object
 7   education_level         250 non-null    object
 8   Communication_Channels  250 non-null    object
 9   Bootcamp_Interest       250 non-null    object
 10  Payment_Date            78 non-null     object
 11  Paid                    297 non-null    object
 12  List_Technologies       244 non-null    object
 13  Study_Domains           244 non-null    object
 14  formal_sector_job       250 non-null    object
 15  have_computer_home      250 non-null    object
 16  internet_at_home        250 non-null    object
dtypes: Int64(1), datetime64[ns, UTC](1), object(15)
memory usage: 42.1+ KB

In [164]:
# Describe the dataset
final_df.describe()

              Age
count  250.000000
mean    25.816000
std      8.287877
min     -1.000000
25%     23.000000
50%     25.500000
75%     29.000000
max     50.000000

In [165]:
# Make sure our columns don't have duplicate values
print("This dataframe have", final_df.duplicated().sum(), "Duplicated value")

This dataframe have 0 Duplicated value

In [166]:
# Check if we have missing values in our columns
print("This dataframe have", final_df.isna().sum(), "missing values")

This dataframe have quest_id                   47
gender                     47
Age                        47
Commune_Name               47
Application_Date           47
Enroll_Date               149
is_enrolled                 0
education_level            47
Communication_Channels     47
Bootcamp_Interest          47
Payment_Date              219
Paid                        0
List_Technologies          53
Study_Domains              53
formal_sector_job          47
have_computer_home         47
internet_at_home           47
dtype: int64 missing values

In [167]:
# How many missing values we have
print("This dataframe have", final_df.isna().sum().sum(), "missing values")

This dataframe have 991 missing values

>##### Data Cleaning

In [168]:
# Dealing with our missing values on each columns
clean_final_df = final_df.fillna(0)

In [169]:
clean_final_df.isna().sum().sum()

0

**Conclusion:** All our empty columns was filled with 0. <br>
Now, let's export our final dataset as csv file

In [170]:
# Exporting CSV file
clean_final_df.to_csv(DATA_PATH + 'final/final-data.csv')